
## :x: Apply Failed

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7697863261)



<pre><code>Error: Error creating Connector: googleapi: Error 409: Requested entity already exists

  with google_vpc_access_connector.internal-vpc-connector,
  on network.tf line 8, in resource &#34;google_vpc_access_connector&#34; &#34;internal-vpc-connector&#34;:
   8: resource &#34;google_vpc_access_connector&#34; &#34;internal-vpc-connector&#34; {

::debug::Terraform exited with code 1.
::debug::stdout: google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_service_account.frontend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.backend-api-resources[&#34;run.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]%0Agoogle_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.backend-api-resources[&#34;secretmanager.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/secretmanager.googleapis.com]%0Agoogle_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_compute_subnetwork.internal-vpc-subnet: Refreshing state... [id=projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet]%0Agoogle_compute_network.internal-vpc-network: Refreshing state... [id=projects/gig-japan-398904/global/networks/int-vpc]%0Agoogle_project_service.network_apis[&#34;vpcaccess.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/vpcaccess.googleapis.com]%0Agoogle_project_service.api-resources[&#34;artifactregistry.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0Agoogle_project_iam_member.frontend-sa-roles[&#34;roles/run.developer&#34;]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0Agoogle_project_iam_member.backend-sa-roles[&#34;roles/secretmanager.secretAccessor&#34;]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles[&#34;roles/iam.serviceAccountUser&#34;]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles[&#34;roles/run.developer&#34;]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles[&#34;roles/iam.serviceAccountTokenCreator&#34;]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/artifactregistry.writer&#34;]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.writer/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/editor&#34;]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/iam.workloadIdentityUser&#34;]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/secretmanager.admin&#34;]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_secret_manager_secret.backend-sa-secret[&#34;weather_api_key&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/weather_api_key]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  &#43; create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.artifact-repository will be updated in-place%0A  ~ resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34; {%0A        id               = &#34;projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai&#34;%0A        name             = &#34;ikigai&#34;%0A        # (10 unchanged attributes hidden)%0A%0A      &#43; docker_config {%0A          &#43; immutable_tags = false%0A        }%0A    }%0A%0A  # google_compute_subnetwork.internal-vpc-subnet will be destroyed%0A  # (because google_compute_subnetwork.internal-vpc-subnet is not in configuration)%0A  - resource &#34;google_compute_subnetwork&#34; &#34;internal-vpc-subnet&#34; {%0A      - creation_timestamp         = &#34;2024-01-29T05:53:49.012-08:00&#34; -&gt; null%0A      - gateway_address            = &#34;10.5.5.1&#34; -&gt; null%0A      - id                         = &#34;projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet&#34; -&gt; null%0A      - ip_cidr_range              = &#34;10.5.5.0/24&#34; -&gt; null%0A      - name                       = &#34;int-vpc-subnet&#34; -&gt; null%0A      - network                    = &#34;https://www.googleapis.com/compute/v1/projects/gig-japan-398904/global/networks/int-vpc&#34; -&gt; null%0A      - private_ip_google_access   = true -&gt; null%0A      - private_ipv6_google_access = &#34;DISABLE_GOOGLE_ACCESS&#34; -&gt; null%0A      - project                    = &#34;gig-japan-398904&#34; -&gt; null%0A      - purpose                    = &#34;PRIVATE&#34; -&gt; null%0A      - region                     = &#34;asia-northeast1&#34; -&gt; null%0A      - secondary_ip_range         = [] -&gt; null%0A      - self_link                  = &#34;https://www.googleapis.com/compute/v1/projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet&#34; -&gt; null%0A      - stack_type                 = &#34;IPV4_ONLY&#34; -&gt; null%0A    }%0A%0A  # google_vpc_access_connector.internal-vpc-connector will be created%0A  &#43; resource &#34;google_vpc_access_connector&#34; &#34;internal-vpc-connector&#34; {%0A      &#43; connected_projects = (known after apply)%0A      &#43; id                 = (known after apply)%0A      &#43; ip_cidr_range      = &#34;10.5.5.0/28&#34;%0A      &#43; machine_type       = &#34;e2-micro&#34;%0A      &#43; max_instances      = 4%0A      &#43; max_throughput     = 500%0A      &#43; min_instances      = 2%0A      &#43; min_throughput     = 200%0A      &#43; name               = &#34;vpc-connector&#34;%0A      &#43; network            = &#34;projects/gig-japan-398904/global/networks/int-vpc&#34;%0A      &#43; project            = &#34;gig-japan-398904&#34;%0A      &#43; region             = &#34;asia-northeast1&#34;%0A      &#43; self_link          = (known after apply)%0A      &#43; state              = (known after apply)%0A    }%0A%0APlan: 1 to add, 1 to change, 1 to destroy.%0Agoogle_compute_subnetwork.internal-vpc-subnet: Destroying... [id=projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet]%0Agoogle_vpc_access_connector.internal-vpc-connector: Creating...%0Agoogle_artifact_registry_repository.artifact-repository: Modifying... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_artifact_registry_repository.artifact-repository: Modifications complete after 2s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_compute_subnetwork.internal-vpc-subnet: Still destroying... [id=projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet, 10s elapsed]%0Agoogle_compute_subnetwork.internal-vpc-subnet: Still destroying... [id=projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet, 20s elapsed]%0Agoogle_compute_subnetwork.internal-vpc-subnet: Destruction complete after 24s%0A
::debug::stderr: %0AError: Error creating Connector: googleapi: Error 409: Requested entity already exists%0A%0A  with google_vpc_access_connector.internal-vpc-connector,%0A  on network.tf line 8, in resource &#34;google_vpc_access_connector&#34; &#34;internal-vpc-connector&#34;:%0A   8: resource &#34;google_vpc_access_connector&#34; &#34;internal-vpc-connector&#34; {%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/a5d3435f-adb0-429a-b1d4-f3b62db76894/terraform-bin apply -input=false -auto-approve -lock=false -no-color
google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]
google_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_service_account.frontend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_service.backend-api-resources["run.googleapis.com"]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]
google_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_service.backend-api-resources["secretmanager.googleapis.com"]: Refreshing state... [id=gig-japan-398904/secretmanager.googleapis.com]
google_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_compute_subnetwork.internal-vpc-subnet: Refreshing state... [id=projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet]
google_compute_network.internal-vpc-network: Refreshing state... [id=projects/gig-japan-398904/global/networks/int-vpc]
google_project_service.network_apis["vpcaccess.googleapis.com"]: Refreshing state... [id=gig-japan-398904/vpcaccess.googleapis.com]
google_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]
google_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]
google_project_iam_member.frontend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]
google_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/artifactregistry.writer"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.writer/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/iam.workloadIdentityUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_secret_manager_secret.backend-sa-secret["weather_api_key"]: Refreshing state... [id=projects/gig-japan-398904/secrets/weather_api_key]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_compute_subnetwork.internal-vpc-subnet will be destroyed
  # (because google_compute_subnetwork.internal-vpc-subnet is not in configuration)
  - resource "google_compute_subnetwork" "internal-vpc-subnet" {
      - creation_timestamp         = "2024-01-29T05:53:49.012-08:00" -> null
      - gateway_address            = "10.5.5.1" -> null
      - id                         = "projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet" -> null
      - ip_cidr_range              = "10.5.5.0/24" -> null
      - name                       = "int-vpc-subnet" -> null
      - network                    = "https://www.googleapis.com/compute/v1/projects/gig-japan-398904/global/networks/int-vpc" -> null
      - private_ip_google_access   = true -> null
      - private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> null
      - project                    = "gig-japan-398904" -> null
      - purpose                    = "PRIVATE" -> null
      - region                     = "asia-northeast1" -> null
      - secondary_ip_range         = [] -> null
      - self_link                  = "https://www.googleapis.com/compute/v1/projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet" -> null
      - stack_type                 = "IPV4_ONLY" -> null
    }

  # google_vpc_access_connector.internal-vpc-connector will be created
  + resource "google_vpc_access_connector" "internal-vpc-connector" {
      + connected_projects = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "10.5.5.0/28"
      + machine_type       = "e2-micro"
      + max_instances      = 4
      + max_throughput     = 500
      + min_instances      = 2
      + min_throughput     = 200
      + name               = "vpc-connector"
      + network            = "projects/gig-japan-398904/global/networks/int-vpc"
      + project            = "gig-japan-398904"
      + region             = "asia-northeast1"
      + self_link          = (known after apply)
      + state              = (known after apply)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
google_compute_subnetwork.internal-vpc-subnet: Destroying... [id=projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet]
google_vpc_access_connector.internal-vpc-connector: Creating...
google_artifact_registry_repository.artifact-repository: Modifying... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_artifact_registry_repository.artifact-repository: Modifications complete after 2s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_compute_subnetwork.internal-vpc-subnet: Still destroying... [id=projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet, 10s elapsed]
google_compute_subnetwork.internal-vpc-subnet: Still destroying... [id=projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet, 20s elapsed]
google_compute_subnetwork.internal-vpc-subnet: Destruction complete after 24s

Error: Error creating Connector: googleapi: Error 409: Requested entity already exists

  with google_vpc_access_connector.internal-vpc-connector,
  on network.tf line 8, in resource "google_vpc_access_connector" "internal-vpc-connector":
   8: resource "google_vpc_access_connector" "internal-vpc-connector" {

::debug::Terraform exited with code 1.
::debug::stdout: google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_service_account.frontend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.backend-api-resources["run.googleapis.com"]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]%0Agoogle_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.backend-api-resources["secretmanager.googleapis.com"]: Refreshing state... [id=gig-japan-398904/secretmanager.googleapis.com]%0Agoogle_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_compute_subnetwork.internal-vpc-subnet: Refreshing state... [id=projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet]%0Agoogle_compute_network.internal-vpc-network: Refreshing state... [id=projects/gig-japan-398904/global/networks/int-vpc]%0Agoogle_project_service.network_apis["vpcaccess.googleapis.com"]: Refreshing state... [id=gig-japan-398904/vpcaccess.googleapis.com]%0Agoogle_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0Agoogle_project_iam_member.frontend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0Agoogle_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/artifactregistry.writer"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.writer/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/iam.workloadIdentityUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_secret_manager_secret.backend-sa-secret["weather_api_key"]: Refreshing state... [id=projects/gig-japan-398904/secrets/weather_api_key]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.artifact-repository will be updated in-place%0A  ~ resource "google_artifact_registry_repository" "artifact-repository" {%0A        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"%0A        name             = "ikigai"%0A        # (10 unchanged attributes hidden)%0A%0A      + docker_config {%0A          + immutable_tags = false%0A        }%0A    }%0A%0A  # google_compute_subnetwork.internal-vpc-subnet will be destroyed%0A  # (because google_compute_subnetwork.internal-vpc-subnet is not in configuration)%0A  - resource "google_compute_subnetwork" "internal-vpc-subnet" {%0A      - creation_timestamp         = "2024-01-29T05:53:49.012-08:00" -> null%0A      - gateway_address            = "10.5.5.1" -> null%0A      - id                         = "projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet" -> null%0A      - ip_cidr_range              = "10.5.5.0/24" -> null%0A      - name                       = "int-vpc-subnet" -> null%0A      - network                    = "https://www.googleapis.com/compute/v1/projects/gig-japan-398904/global/networks/int-vpc" -> null%0A      - private_ip_google_access   = true -> null%0A      - private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> null%0A      - project                    = "gig-japan-398904" -> null%0A      - purpose                    = "PRIVATE" -> null%0A      - region                     = "asia-northeast1" -> null%0A      - secondary_ip_range         = [] -> null%0A      - self_link                  = "https://www.googleapis.com/compute/v1/projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet" -> null%0A      - stack_type                 = "IPV4_ONLY" -> null%0A    }%0A%0A  # google_vpc_access_connector.internal-vpc-connector will be created%0A  + resource "google_vpc_access_connector" "internal-vpc-connector" {%0A      + connected_projects = (known after apply)%0A      + id                 = (known after apply)%0A      + ip_cidr_range      = "10.5.5.0/28"%0A      + machine_type       = "e2-micro"%0A      + max_instances      = 4%0A      + max_throughput     = 500%0A      + min_instances      = 2%0A      + min_throughput     = 200%0A      + name               = "vpc-connector"%0A      + network            = "projects/gig-japan-398904/global/networks/int-vpc"%0A      + project            = "gig-japan-398904"%0A      + region             = "asia-northeast1"%0A      + self_link          = (known after apply)%0A      + state              = (known after apply)%0A    }%0A%0APlan: 1 to add, 1 to change, 1 to destroy.%0Agoogle_compute_subnetwork.internal-vpc-subnet: Destroying... [id=projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet]%0Agoogle_vpc_access_connector.internal-vpc-connector: Creating...%0Agoogle_artifact_registry_repository.artifact-repository: Modifying... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_artifact_registry_repository.artifact-repository: Modifications complete after 2s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_compute_subnetwork.internal-vpc-subnet: Still destroying... [id=projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet, 10s elapsed]%0Agoogle_compute_subnetwork.internal-vpc-subnet: Still destroying... [id=projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet, 20s elapsed]%0Agoogle_compute_subnetwork.internal-vpc-subnet: Destruction complete after 24s%0A
::debug::stderr: %0AError: Error creating Connector: googleapi: Error 409: Requested entity already exists%0A%0A  with google_vpc_access_connector.internal-vpc-connector,%0A  on network.tf line 8, in resource "google_vpc_access_connector" "internal-vpc-connector":%0A   8: resource "google_vpc_access_connector" "internal-vpc-connector" {%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform_apply","PRNumber":39,"Program":"tfcmt","SHA1":"eec460b65f312b3156d285ed8cc097c59100a138","Vars":{},"WorkflowName":"iaac_apply"} -->